src/InformationRegisters/НастройкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонОбследований</Name>
					<Comment>Основной шаблон обследований</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПриемНесколькихПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяРучнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ВремяРаботыСотрудниковПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВремяРаботыСотрудниковПлан</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Минуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцОтбор</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Сотрудник является клиентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIВес</Name>
					<Comment>Вес сотрудника для API, сначала выводятся более тяжелые</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Comment>Код по ОМС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляСайтаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпецилазацииСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Comment>Основная специализация</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницыЖурналаЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Helix/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

#Область ПредопределенныеПроцедурыСЛК

// Ссылка на менеджер объектов, который создал этот объект, получена 
// в предопредленной процедуре "ПриСозданииОбъекта"
// Раскомментировать при создании защищенной обработки через License edit
// Перем _менджерОбъектов;

//
// Предопределенная процедура, вызывающаяся при создании объекта методом "СоздатьОбъект"
//
// Позволяет разработчику запретить создание обаботки, для чего 
// необходимо установить значение параметра "Отказ" в "Истина"
//
// МенеджерЛицензий - ссылка на менеджре лицензий, которым создан объект
// Отказ            - признак запрета создания
// ОписаниеОшибки   - описание ошибки, устанавливаемое разработчиком в случае запрета 
// создания объекта
// 
// В этой процедуре рекомендуется проверять значения лицензионных 
// параметров и в зависимости от них разрешить или запретить создание 
// объекта.
//
Процедура ПриСозданииОбъекта(МенеджерОбъектов, Отказ, ОписаниеОшибки) Экспорт
	ПростоПеременная = "";
	// Раскомментировать при создании защищенной обработки через License edit
	//	_менеджерОбъектов = МенеджерОбъектов;
КонецПроцедуры

//
// Предопределенная процедура, вызывающаяся при создании объекта методом 
// "СоздатьОбъект" перед проверкой лицензии сеанса
//
// Позволяет разработчику отказаться от проверки лицензии, для чего 
// необходимо установить значение параметра "Отказ" в "Истина".
//
// Используется в случае когда достаточно только защитить код и данные объекта и 
// нет необходимости в контроле лицензий
//
Процедура ПередКонтролемЛицензии(Отказ) Экспорт
	Отказ = Ложь;
КонецПроцедуры

//
// Предопределенная процедура, вызывающаяся при создании объекта методами 
// "Создать" и "СоздатьПоСсылке"
//
Процедура ПриСоздании(МенеджерЛицензий, КлиентскаяСылка, Отказ, ОписаниеОшибки) Экспорт
	// Контроль лицензий сеанса выполняется при создании объекта методом 
	// "СоздатьОбъект". 
	//
	// Чтобы объект было невозможно создать старвми методами без контроля 
	// лицензий сеанса запрещаем создание
	Отказ = Истина;
КонецПроцедуры

//
// Пример функции, использующей значение лицензионного параметра. Для получения 
// значения используется менеджер объектов, установленный в предопредленной 
// процедуре "ПриСозданииОбъекта" (см. выше)
//
Функция МетодОбъекта() Экспорт
	Стр = "";
	// Раскомментировать при создании защищенной обработки через License edit
	// Стр = 
	//  ЭтотОбъект.Метаданные().ПолноеИмя() + Символы.ПС +
	//  "Ключ = " + Строка(_менеджерОбъектов.ПолучитьНомерКлюча()) +
	//  ", ТипПриложения=" + _менеджерОбъектов.ПолучитьЗначениеПараметра("ТипПриложения");
	Возврат Стр;
КонецФункции

#КонецОбласти


#Область ПроцедурыОбъектаГрафикРаботыСотрудников

&НаСервере
// Процедура считывает данные с регистра и заполняет ими Таблицу значений ГрафикПериодовРаботы
//
Функция ПрочитатьИЗаполнитьГрафикРаботыИзРегистра(ГрафикПериодовРаботы, Параметры) Экспорт
	
	ГрафикПериодовРаботы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Должность,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания,
	|	ВремяРаботыСотрудниковПлан.Минуты,
	|	НАЧАЛОПЕРИОДА(ЕСТЬNULL(ВремяРаботыСотрудниковПлан.ДатаВремяНачала, &НачалоМесяца), МЕСЯЦ) КАК Период
	|ИЗ
	|	(ВЫБРАТЬ
	|		&СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		Сотрудники.Ссылка КАК Сотрудник,
	|		Сотрудники.Должность КАК Должность
	|	ИЗ
	|		Справочник.Сотрудники КАК Сотрудники
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|			ПО Сотрудники.Ссылка = НастройкиСотрудников.Сотрудник
	|	ГДЕ
	|		НЕ Сотрудники.ЭтоГруппа
	|		И НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|		И ВЫБОР
	|				КОГДА НастройкиСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА НастройкиСотрудников.ДатаУвольнения > &НачалоМесяца
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		И НЕ Сотрудники.ПометкаУдаления) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|		ПО ВложенныйЗапрос.Сотрудник = ВремяРаботыСотрудниковПлан.Сотрудник
	|			И (ВремяРаботыСотрудниковПлан.ДатаВремяНачала МЕЖДУ &НачалоМесяца И &КонецМесяца)
	|			И ВложенныйЗапрос.СтруктурнаяЕдиница = ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Параметры.Месяц));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Параметры.Месяц));
	Запрос.УстановитьПараметр("ПустаяДата", Дата(01, 01, 01));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	
	// Заполняем график работы
	
	Для Каждого СтрокаПериодРаботы Из ТаблицаРезультата Цикл
		
		ПараметрыОтбора = Новый Структура("Сотрудник", СтрокаПериодРаботы.Сотрудник);
		СтрокаГрафикаРаботы = ГрафикПериодовРаботы.НайтиСтроки(ПараметрыОтбора);
		Если СтрокаГрафикаРаботы.Количество() = 0 Тогда
			СтрокаГрафикаРаботы = ГрафикПериодовРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаГрафикаРаботы, СтрокаПериодРаботы);
		Иначе
			СтрокаГрафикаРаботы = СтрокаГрафикаРаботы[0];
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПериодРаботы.ДатаВремяНачала) Тогда
			Продолжить;
		КонецЕсли;
		
		ПериодСтруктура = Новый Структура("НачалоСмены, ОкончаниеСмены", СтрокаПериодРаботы.ДатаВремяНачала, СтрокаПериодРаботы.ДатаВремяОкончания);
		СтрокаГрафикаРаботы["День" + День(СтрокаПериодРаботы.ДатаВремяНачала)].Добавить(ПериодСтруктура, Формат(ПериодСтруктура.НачалоСмены, "ДФ='ЧЧ:мм'") + " - " + Формат(ПериодСтруктура.ОкончаниеСмены, "ДФ='ЧЧ:мм'"));
		
	КонецЦикла;	
	
КонецФункции

&НаСервере
// Процедура обрабатывает видимость, заголовок колонок таблицы
//
Процедура ОбновитьПредставлениеДняВКолонках(ГрафикПериодовРаботы, Параметры) Экспорт
	
	// ИЗ ЗА ЭТИХ СТРОЧЕК ПРОИСХОДИТ 4 РАЗА ВЫЗОВЫ СЕРВЕРА ----------
	Для а = 1 По 31 Цикл
		ДатаДня = НачалоМесяца(Параметры.Месяц) + (а - 1) * 60 * 60 * 24;
		ПолеЭлемента = ГрафикПериодовРаботы.ПодчиненныеЭлементы["ТаблицаГрафикаДень" + а];
		ПолеЭлемента.Заголовок = Строка(а);
		
		Если Не ЗначениеЗаполнено(Параметры.Месяц) Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеЭлемента.Видимость = (а <= День(КонецМесяца(Параметры.Месяц)));
		ПолеЭлемента.Заголовок = ПолеЭлемента.Заголовок + Символы.ПС + Формат(ДатаДня, "ДФ=ддд");
		Если ДеньНедели(ДатаДня) = 6 Или ДеньНедели(ДатаДня) = 7 Тогда 
			ПолеЭлемента.ЦветФонаЗаголовка = Новый Цвет(255, 255, 255);
			ПолеЭлемента.ЦветФона = Новый Цвет(255, 192, 203);
		Иначе
			ПолеЭлемента.ЦветФонаЗаголовка = Новый Цвет(255, 255, 255);
			ПолеЭлемента.ЦветФона = Новый Цвет;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура, записывает внешнюю систему.
// 
Процедура ЗаписатьВнешнююСистему(ВнешняяСистема, АвторизацияПоКодуБезСМС, ПараметрыВС = Неопределено) Экспорт
	
	ВнешняяСистемаОбъект = ВнешняяСистема.ПолучитьОбъект();
	
	Если АвторизацияПоКодуБезСМС <> ВнешняяСистема.АвторизацияПоКодуБезСМС Тогда
		ВнешняяСистемаОбъект.АвторизацияПоКодуБезСМС = АвторизацияПоКодуБезСМС;     
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыВС) И ТипЗнч(ПараметрыВС) = Тип("Структура") Тогда
		
		ПараметрыВнешнейСистемы = ВнешняяСистемаОбъект.Параметры.Получить();
		
		Если ПараметрыВнешнейСистемы = Неопределено Тогда 
			ПараметрыВнешнейСистемы = Новый Структура();
		КонецЕсли;
		
		Для Каждого ПараметрВС Из ПараметрыВС Цикл
			
			Если ПараметрыВнешнейСистемы.Свойство(ПараметрВС.Ключ) Тогда 
				ПараметрыВнешнейСистемы[ПараметрВС.Ключ] = ПараметрВС.Значение;
			Иначе
				ПараметрыВнешнейСистемы.Вставить(ПараметрВС.Ключ, ПараметрВС.Значение);
			КонецЕсли;
			
		КонецЦикла;		
		
		ВнешняяСистемаОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
		
	КонецЕсли;
	
	ВнешняяСистемаОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти 
	
#КонецОбласти
